{
  "userQuestion": "How can I represent step counts from my fitbit?",
  "draftAnswer": "To represent step counts from your fitbit, you can use the FHIR Observation resource. This resource is used to capture data that is measured or derived from a patient. The Observation resource has a `valueQuantity` element which is used to represent the measured value, such as the number of steps taken. Additionally, the Observation resource can also be used to capture the source of the data, such as the fitbit device. For more information about the Observation resource, please refer to the [FHIR Observation documentation](https://www.hl7.org/fhir/observation.html).",
  "history": [
    {
      "type": "SEARCH",
      "q": "Observation",
      "results": [
        {
          "filename": "observationdefinition.txt",
          "chunk": 0,
          "content": "observationdefinition.txt\n8.26 Resource ObservationDefinition Content []\n\n \n  Orders and Observations [] Work Group Maturity Level: 0  Trial Use Security Category: Business Compartments: Not linked to any defined compartments\n \n\nSet of definitional characteristics for a kind of observation or\nmeasurement produced or consumed by an orderable health care service.\n\n"
        },
        {
          "filename": "observation.txt",
          "chunk": 3,
          "content": "observation.txt\n10.1.2 Boundaries and Relationships []\n\nAt its core, Observation allows expressing a name-value pair or\nstructured collection of name-value pairs. As such, it can support\nconveying any type of information desired. However, that is not its\nintent. Observation is intended for capturing measurements and\nsubjective point-in-time assessments. It is not intended to be used for\nthose specific contexts and use cases already covered by other FHIR\nresources. For example, the AllergyIntolerance resource represents a\npatient allergies, MedicationStatement resource: medications taken by a\npatient, FamilyMemberHistory resource: a patient's family history,\nProcedure resource: information about a procedure, and\nQuestionnaireResponse resource: a set of answers to a set of questions.\nThe Observation resource should not be used to record clinical diagnosis\nabout a patient or subject that are typically captured in the Condition\nresource or the ClinicalImpression resource. The Observation resource is\noften referenced by the Condition resource to provide specific\nsubjective and objective data to support its assertions. There will\nhowever be situations of overlap. For example, a response to a question\nof \"have you ever taken illicit drugs\" could in principle be represented\nusing MedicationStatement, but most systems would treat such an\nassertion as an Observation. In some cases, such as when source data is\ncoming from an HL7 v2 [] feed, a system might not have information that\nallows it to distinguish diagnosis, allergy and other \"specialized\"\ntypes of observations from laboratory, vital sign and other observation\ntypes intended to be conveyed with this resource. In those\ncircumstances, such specialized observations may also appear using this\nresource. Adhering to such convention is an appropriate use of\nObservation. If implementers are uncertain whether a proposed use of\nObservation is appropriate, they're encouraged to consult with\nimplementers on chat.fhir.org implementer's stream []\n\nThe Media resource captures a specific type of observation whose value\nis audio, video or image data. This resource is used instead of\nObservation to represent such forms of information as it exposes the\nmetadata relevant for interpreting the information. See Media's\nboundaries section to see how Media (and Observation) differs from\nImagingStudy and DocumentReference.\n\nIn contrast to the Observation resource, the DiagnosticReport resource\ntypically includes additional clinical context and some mix of atomic\nresults, images, imaging reports, textual and coded interpretation, and\nformatted representations. Laboratory reports, pathology reports, and\nimaging reports should be represented using the DiagnosticReport\nresource. The Observation resource is referenced by the DiagnosticReport\nto provide the atomic results for a particular investigation.\n\"Laboratories routinely have a variable that is summative across a\nseries of discrete variables these are usually called 'impressions' or\n'interpretations'. Sometimes they are algorithmically specified and\nsometimes they have the imprimatur of pathologists and they are conveyed\nin Observation or DiagnosticReport instead of the Clinical Impression\nresource. The Observation resource should not be used to record clinical\ndiagnosis about a patient or subject as discussed above.\n\n"
        },
        {
          "filename": "observation.txt",
          "chunk": 0,
          "content": "observation.txt\n10.1 Resource Observation Content []\n\n \n  Orders and Observations [] Work Group Maturity Level: N  Normative (from v4.0.0) Security Category: Patient Compartments: Device, Encounter, Patient, Practitioner, RelatedPerson\n \n\n \n  [] This page has been approved as part of an ANSI [] standard. See the Observation Package for further details.\n \n\nMeasurements and simple assertions made about a patient, device or other\nsubject.\n\n"
        },
        {
          "filename": "observation.txt",
          "chunk": 1,
          "content": "observation.txt\n10.1.1 Scope and Usage []\n\nThis resource is an event resource from a FHIR workflow perspective -\nsee Workflow.\n\nObservations are a central element in healthcare, used to support\ndiagnosis, monitor progress, determine baselines and patterns and even\ncapture demographic characteristics. Most observations are simple\nname/value pair assertions with some metadata, but some observations\ngroup other observations together logically, or even are multi-component\nobservations. Note that the DiagnosticReport resource provides a\nclinical or workflow context for a set of observations and the\nObservation resource is referenced by DiagnosticReport to represent\nlaboratory, imaging, and other clinical and diagnostic data to form a\ncomplete report.\n\nUses for the Observation resource include:\n\n Vital signs such as body weight, blood pressure, and temperature\n Laboratory Data like blood glucose, or an estimated GFR\n Imaging results like bone density or fetal measurements\n Clinical Findings^(*) such as abdominal tenderness\n Device measurements such as EKG data or Pulse Oximetry data\n Clinical assessment tools such as APGAR or a Glasgow Coma Score\n Personal characteristics: such as eye-color\n Social history like tobacco use, family support, or cognitive status\n Core characteristics like pregnancy status, or a death assertion\n\n^(*)The boundaries between clinical findings and disorders remains a\nchallenge in medical ontology. Refer the Boundaries section below and in\nCondition for general guidance. These boundaries can be clarified by\nprofiling Observation for a particular use case.\n\n"
        },
        {
          "filename": "observationdefinition.txt",
          "chunk": 1,
          "content": "observationdefinition.txt\n8.26.1 Scope and Usage []\n\n  Note that this content is preliminary has not undergone proper review\n  by the appropriate Workgroups.\n\nAn instance of ObservationDefinition represents the definitional aspects\nof a kind of observation. This resource is used in a catalog of products\nor services for healthcare. It provides the definition of observations,\nwhich are used as input or produced as outcome of these products and\nservices. The focus of the definitional aspects of ObservationDefinition\nis not on the action of performing observations of that kind. Rather, it\nis on the outcome of the observations. An instance of\nObservationDefinition represents a set of constraints applicable to the\nvalue produced by observations of this kind. This set of constraints may\nhave two utilities: 1) It guides the entry of the result of an\nobservation of the kind defined. 2) It helps the consumer of the results\nof observations of that kind, to interpret properly these results.\n\nFor instance, in a catalog of laboratory in vitro diagnostic services,\nthe ObservationDefinition resources describe the observations that\nshould be provided by the orderer alongside with an ordered service\n(questions asked at order entry or at specimen collection, prior\nresults) as well as the observations that will be reported once the\nservice has been performed.\n\nIn a catalog of medications, ObservationDefinition resources can be used\nto describe observations the result thereof need to be checked against\nthe prescription of a particular medicinal product (therapeutic range,\nunits ...)\n\nIn the catalog of tests of an in vitro diagnostic device,\nObservationDefinition resources can be used to characterize (absolute\nrange, unit, decimal precision, critical values ...) the observations\nthat will be produced by the IVD tests performed by the device.\n\nObservationDefinition may be used to characterize observations from any\ndiscipline.\n\n"
        }
      ],
      "presented": 0
    }
  ]
}